[
    {
        "id":5616,
        "Company":"Lowe's India",
        "Location":"Bengaluru, Karnataka, India (Hybrid)",
        "Salary":null,
        "Application ID":"https:\/\/www.linkedin.com\/jobs\/view\/4246223400\/?eBP=CwEAAAGXiX9bZOEwk1BEUTv6nrA5-R1cdQ4rx7RPCWMURcgcZUiDIRNoxEfH6FqWDE5dIake3b39Rc0zLSNPR2WC39GjztJHxBRVvEtu9EQSWerAhpRYWKHdmmXy_Fb_WdV8lztunCtBUmLVLfew_U0PIuI_BZNElBV1x_Wfw1q2V5LFcbD5ioXSKST41JKjJ5Xpvb_lIpvpCTZHsiMMVj3gyVsaVO4cHwjZGWAy55OcuIEctGcumCMfnRE-NHyxetuKV_m_s7GeLHOhlcMmxVyymQSe6oMKyky5Q5W4UMYNroc9_IIcltIdBQG88NeRmLs0XK3yhnh7R6Hx_azcdA2rzb1n-7lQMUaivnr1PX2Xukr_Mhpqqf5EzzkgottCTLFlusPgiqCXROSoZUXHgxuWRib_CrApGJg8xp3j23-fJXh2l1WfgmAbgKfz5BqYIEg1U2AJaSpxaXoWiZ_9vWsKuqRmvuyPByPGjjopL8ucp90&refId=EJk%2BNEjcIrugW%2FvjpcpktQ%3D%3D&trackingId=Sqi3oNojPz6fD%2BSVWSHF1Q%3D%3D&trk=flagship3_search_srp_jobs",
        "Description":"About the job\nAbout Lowe’s\nLowe’s Companies, Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving approximately 16 million customer transactions a week in the United States. With total fiscal year 2023 sales of more than $86 billion, Lowe’s operates over 1,700 home improvement stores and employs approximately 300,000 associates. Based in Bengaluru, Lowe’s India develops innovative technology products and solutions and delivers business capabilities to provide the best omnichannel experience for Lowe’s customers. Lowe’s India employs over 4,200 associates across technology, analytics, merchandising, supply chain, marketing, finance and accounting, product management and shared services. Lowe’s India actively supports the communities it serves through programs focused on skill-building, sustainability and safe homes. For more information, visit, www.lowes.co.in.\n\nAbout the Team\nInternal Audit is an independent assurance\/advisory function reporting functionally to the audit committee of the Board and administratively to the Finance function(CFO). IA is responsible for planning, executing, and reporting operational, compliance, financial, and technology audits.\n\nJob Summary:\nThis role will assist the Lead Auditors in conducting Operational Audits. For Operational Audits, Internal Audit at Lowe's focuses primarily on value-add, operational audits with high visibility to Lowe's Leadership. The primary purpose of this role is to work closely with the Lead Auditors and project teams by assisting in planning, developing and executing of audit testing. Additionally, the Trainee Auditor will prepare inputs to written communication and deliverables for audit engagements involving the use of data analytic skills, process analysis, and critical thinking. Overall, this role will assist in audits that evaluate the effectiveness of internal controls established to manage Lowe's most significant risks.\n\nRoles & Responsibilities:\nCore Responsibilities:\nAssists with Internal Audit’s oversight role in the Company's SOX 404 assessment, including SOX program planning activities, performing independent SOX testing, reviewing management’s testing, and driving SOX-related administrative activities such as reporting of internal controls over financial reporting.\nIdentifies and documents aspects of the organization's systems and processes that do not comply with regulations,\nlaws, and standards or do not comply with the organization's policies and operating procedures\nAssist in identifying key risks, develops process mapping and conducts testing for in-scope controls.\nCollects preliminary data and conducts analysis and assists Lead and Senior Auditor in detecting deficient controls, inefficiencies, duplicated effort, extravagance, fraud, or non-compliance with laws, regulations, and management policies\nPerforms data analysis to deliver valuable insights to management, when applicable\nAssists Lead\/Senior Auditor in the detailed report and summarization of audit findings\nProvides support for coordinating with the client and management to ensure project timelines are met\nOrganizes resources, information, and significant findings from root cause, risk exposure, and management analysis.\nResponsible for work paper standards. \nParticipates in rotational committee work such as internal quality reviews, issue follow up and training coordination to gain extensive knowledge and experience in key audit functional areas\n\nYears of Experience:\n0-2 years(Full Time)\n\nEducation Qualification & Certifications (optional)\nRequired Minimum Qualifications:\nIndustrial trainee Eligibility as per current ICAI guidelines\n\nSkill Set Required\nPrimary Skills (must have) \nInternal Audit\nSecondary Skills (desired)\nAccounting \/ statutory audit",
        "created_at":1750358551956,
        "updated_at":1750358551956,
        "Category":"Auditing",
        "Created_At":1750358551956,
        "connect_link":null,
        "Job_Title":null,
        "Company_Logo_URL":null,
        "Apply_Link":null,
        "Posted_Date":null,
        "Employment_Type":null,
        "Seniority_Level":null,
        "Applicant_Count":null,
        "Is_Easy_Apply":false,
        "Description_HTML":null,
        "Industry":null
    },
    {
        "id":5641,
        "Company":"Bansal & Co LLP",
        "Location":"Gurugram, Haryana, India",
        "Salary":null,
        "Application ID":"https:\/\/www.linkedin.com\/jobs\/view\/4253200601\/?eBP=BUDGET_EXHAUSTED_JOB&refId=Atsbao6h3SSfLzRz3a6YwA%3D%3D&trackingId=PMk8IzqKssZbvqwGyov9KQ%3D%3D&trk=flagship3_search_srp_jobs",
        "Description":"About the job\n\nExperience - 0-1 year\nLocation - DLF City Phase - IV, Gurugram\nNo of vacancies - 3\n\nAudit Support and Execution:\n\nAssist in planning and executing internal audits across various departments and functions.\nSupport the preparation and execution of audit programs, working papers, and audit reports.\nGather and analyze relevant data for audits and assessments.\n\nDocumentation and Reporting:\n\nMaintain and organize comprehensive audit documentation and files, ensuring all supporting materials are properly recorded and accessible.\nDraft audit reports summarizing findings, risks, and recommendations for improvement.\nTrack audit progress and follow-up on audit action plans to ensure corrective actions are implemented.\n\nRisk Identification and Control Testing:\n\nAssist with risk assessments and help identify control weaknesses or areas for improvement in business processes.\nSupport the testing of internal controls and provide insights into areas that require stronger risk mitigation strategies.\n\nCompliance and Regulatory Support:\n\nAssist with ensuring that the organization complies with relevant laws, regulations, and internal policies.\nStay up to date on changes in regulatory requirements and assist in implementing necessary changes to internal audit processes.\n\nLiaison and Communication:\n\nWork closely with cross-functional teams, providing audit support and fostering communication to gather required information and documents.\nFacilitate the exchange of audit-related information between internal teams, external auditors, and other stakeholders.\n\nAudit Follow-Up and Monitoring:\n\nAssist with the follow-up on audit recommendations and track the progress of corrective actions to ensure timely resolution.\nMaintain a system to monitor the status of open audit issues and ensure issues are addressed in a timely manner.\n\nProcess Improvement:\n\nAssist in identifying opportunities for improvement in audit processes and control procedures.\nParticipate in initiatives to streamline the audit process and enhance overall efficiency.\n\nConfidentiality and Integrity:\n\nMaintain confidentiality in handling audit-related information and sensitive company data.\nDemonstrate a high level of integrity and professionalism when interacting with colleagues and management.\n\nTraining and Development:\n\nContinuously enhance knowledge of auditing standards, tools, and best practices.\nParticipate in internal or external training opportunities to strengthen auditing skills and industry knowledge.\n\nMail your Resume on kavita@bansalco.com",
        "created_at":1750712918741,
        "updated_at":1750712918741,
        "Category":"Auditing",
        "Created_At":1750712918741,
        "connect_link":null,
        "Job_Title":null,
        "Company_Logo_URL":null,
        "Apply_Link":null,
        "Posted_Date":null,
        "Employment_Type":null,
        "Seniority_Level":null,
        "Applicant_Count":null,
        "Is_Easy_Apply":false,
        "Description_HTML":null,
        "Industry":null
    },
    {
        "id":6343,
        "Company":"Top NBFC",
        "Location":"Mumbai, Maharashtra",
        "Salary":null,
        "Application ID":"https:\/\/lnkd.in\/gxHdPxp3",
        "Description":"CA Industrial Training Opportunity! 👋 We are inviting applications for the position of CA Industrial Trainees to join the Internal Audit Team at a top NBFC. Immediate joiners preferred. Kickstart your CA industrial training journey here! 🚀",
        "created_at":1761376759089,
        "updated_at":1761376759089,
        "Category":"Auditing",
        "Created_At":1761376759089,
        "connect_link":null,
        "Job_Title":null,
        "Company_Logo_URL":null,
        "Apply_Link":null,
        "Posted_Date":null,
        "Employment_Type":null,
        "Seniority_Level":null,
        "Applicant_Count":null,
        "Is_Easy_Apply":false,
        "Description_HTML":null,
        "Industry":null
    },
    {
        "id":3812,
        "Company":"Caterpillar",
        "Location":"Tiruvallur",
        "Salary":null,
        "Application ID":"https:\/\/www.linkedin.com\/in\/rajarajeswari-rajendran-028b15169?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACg1xuABYPiWZOD2rQcElAxaJ7oJO2bzOqQ&lipi=urn%3Ali%3Apage%3Ad_flagship3_search_srp_content%3Bx4QJ16x1Q4u3If5cTjd6wA%3D%3D",
        "Description":"Hi Connections,\n\nLooking for a CA \/ CMA industrial trainee for Caterpillar Tiruvallur location. Interested candidates share their resume in DM.",
        "created_at":1741514459143,
        "updated_at":1741514459143,
        "Category":"Finance",
        "Created_At":1741478400000,
        "connect_link":null,
        "Job_Title":null,
        "Company_Logo_URL":null,
        "Apply_Link":null,
        "Posted_Date":null,
        "Employment_Type":null,
        "Seniority_Level":null,
        "Applicant_Count":null,
        "Is_Easy_Apply":false,
        "Description_HTML":null,
        "Industry":null
    },
    {
        "id":6345,
        "Company":"Tata Communications",
        "Location":"Mumbai & Pune",
        "Salary":null,
        "Application ID":"https:\/\/lnkd.in\/dbaGDgtp",
        "Description":"Exciting Opportunity for CA Industrial Trainees! Tata Communications is inviting CA students eligible for Industrial Training to join their Finance Team. This is a fantastic chance to gain valuable hands-on experience in a dynamic corporate environment. If you're a motivated future CA eager to enhance your skills and contribute meaningfully, apply now! 💼",
        "created_at":1761376765236,
        "updated_at":1761376765236,
        "Category":"Finance",
        "Created_At":1761376765236,
        "connect_link":null,
        "Job_Title":null,
        "Company_Logo_URL":null,
        "Apply_Link":null,
        "Posted_Date":null,
        "Employment_Type":null,
        "Seniority_Level":null,
        "Applicant_Count":null,
        "Is_Easy_Apply":false,
        "Description_HTML":null,
        "Industry":null
    }
]